README.org
#                            -*- mode: org; -*-
#
#+TITLE:              OpenFOAM-dev Third-Party packages
#+AUTHOR:                  The OpenFOAM Foundation
#+DATE:                       25st July 2017
#+LINK:                     http://www.openfoam.org
#+OPTIONS: author:nil ^:{}
# Copyright (c) 2014-2016 OpenFOAM Foundation.

* Description
  Scripts for building third-party packages.
* [[https://openfoam.org/download/source/third-party-software/][Download and installation instructions]]
* Order of execution:
  + makeGcc   (recommended if the system gcc is < 4.8)
  + Allwmake  (Builds OpenMPI, Scotch etc.)
  + makeParaView
*** Optional
    + AllwmakeLibccmio (Only required for conversion of STAR-CCM+ meshes)
    + Allclean (Only required to save disk space)
* Versions and locations to download the third party packages
*** Gcc C++ Compiler
    The minimum version of gcc required is 4.8.0
    + gcc   http://gcc.gnu.org/releases.html
    + gmp   http://gmplib.org/
            ftp://ftp.gnu.org/gnu/gmp/gmp-5.1.2.tar.bz2
    + mpfr  http://www.mpfr.org/
            ftp://ftp.gnu.org/gnu/mpfr/mpfr-3.1.2.tar.bz2
    + mpc   http://www.multiprecision.org/
            http://www.multiprecision.org/mpc/download/mpc-1.0.1.tar.gz
*** Parallel Processing
***** Scotch
      Scotch-6.0.3 is provided with ThirdParty-dev or the original source pack
      may be obtained from:
      + Scotch/PtScotch: https://gforge.inria.fr/frs/download.php/file/34099/scotch_6.0.3.tar.gz
***** OpenMPI
      + OpenMPI: https://www.open-mpi.org/software/ompi/v2.1/downloads/openmpi-2.1.1.tar.bz2
*** ParaView
    Patched versions of the ParaView source code were once provided for ParaView
    v5.0.1.  With the current supported version of ParaView (v.5.4.0), the
    source code
    + ParaView-5.4.0 http://www.paraview.org/files/v5.4/ParaView-v5.4.0.tar.gz
    is downloaded automatically and compiles without modification.  ParaView is
    compiled by running the =makeParaView= script, i.e.
    + ./makeParaView
    Expect ParaView to take a long time to compile, typically several hours on a
    desktop computer.  Following compilation, update the environment by sourcing
    the .bashrc (or .cshrc) file or by typing
    + wmRefresh
*** CGAL
    + CGAL        https://github.com/CGAL/cgal/releases/download/releases%2FCGAL-4.8.1/CGAL-4.8.1.tar.xz
    + boost       http://sourceforge.net/projects/boost/files/boost/1.55.0/boost_1_55_0.tar.bz2/download
*** Miscellaneous
    + libccmio    http://portal.nersc.gov/svn/visit/trunk/third_party/libccmio-2.6.1.tar.gz

# --------------------------------------------------------------------------
